import re

test0 = ('Довольно распространённая ошибка ошибка – это лишний повтор повтор слова слова. Смешно, не не правда ли? '
         'Не нужно портить хор хоровод.')
    # Довольно распространённая ошибка – это лишний повтор слова. Смешно, не правда ли?
    # Не нужно портить хор хоровод.
test1 = ('У лукоморья дуб дуб зеленый, Златая цепь на на дубе дубе том том: И днем и и ночью кот ученый '
         'Всё ходит по цепи кругом, Идет идет направо — песнь песнь заводит, Налево — сказку говорит.')
    # У лукоморья дуб зеленый, Златая цепь на дубе том: И днем и ночью кот ученый
    # Всё ходит по цепи кругом, Идет направо — песнь заводит, Налево — сказку говорит.
test2 = ('Туманы над  над Днепром глубоким; Пора коням    коням их   их отдохнуть. '
         'Вот вот под  под горой   горой путем    путем широким Широкий пересекся путь.')
    # Туманы над Днепром глубоким; Пора коням их отдохнуть.
    # Вот под горой путем широким Широкий пересекся путь.
test3 = 'Сбылись давнишние мечты, Сбылися пылкие желанья! Минута сладкого свиданья, И для меня блеснула ты!'
    # Сбылись давнишние мечты, Сбылися пылкие желанья! Минута сладкого свиданья, И для меня блеснула ты!
test4 = 'Вол волку говорит, что видел, как еж ежевику собирал, а хор хоровод водил.'
    # Вол волку говорит, что видел, как еж ежевику собирал, а хор хоровод водил.
test5 = 'Вол вол волку говорит, что видел, как еж ежевику собирал, а хор хоровод водил водил.'
    # Вол волку говорит, что видел, как еж ежевику собирал, а хор хоровод водил.'

tests = [test0, test1, test2, test3, test4, test5]

pattern = r"(\b\w+\b)\s+\1"

for text in tests:
    result = re.sub(pattern, r"\1", text, flags=re.IGNORECASE)
    print('Ввод:\n', text)
    print()
    print('Вывод:\n', result)
    print('__________________')
